УчетИНагрузкаППС/src/Documents/ПроектШтатногоРасписания/ПроектШтатногоРасписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроектШтатногоРасписания</name>
  <registerRecords>InformationRegister.ШтатноеРасписание</registerRecords>
  <registerRecords>InformationRegister.ШтатныеРасписанияПодразделений</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныеГоды</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Первичный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасовГИА</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасовГИААспирантура</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасовДОТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасовГИАДОТ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасовИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Нагрузка</name>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗанятости</name>
      <type>
        <types>EnumRef.ВидыЗанятости</types>
      </type>
    </attributes>
    <attributes>
      <name>УченаяСтепень</name>
      <type>
        <types>CatalogRef.УченыеСтепени</types>
      </type>
    </attributes>
    <attributes>
      <name>УченоеЗвание</name>
      <type>
        <types>CatalogRef.УченыеЗвания</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСтавок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоЧасыДОТ</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УчетИНагрузкаППС/src/Documents/ПроектШтатногоРасписания/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные для движений по регистрам.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
// Параметры:
//  Ссылка - ДокументСсылка.ПроектШтатногоРасписания - ссылка на текущий документ
//  ДополнительныеСвойства - Структура - Структура данных для подсистемы печати
//
Процедура ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ПроектШтатногоРасписанияНагрузка.Ссылка.Дата,
	|	ПроектШтатногоРасписанияНагрузка.Ссылка.УчебныйГод,
	|	ПроектШтатногоРасписанияНагрузка.Ссылка.Подразделение,
	|	ПроектШтатногоРасписанияНагрузка.Преподаватель,
	|	ПроектШтатногоРасписанияНагрузка.Должность,
	|	ПроектШтатногоРасписанияНагрузка.ВидЗанятости,
	|	ПроектШтатногоРасписанияНагрузка.УченаяСтепень,
	|	ПроектШтатногоРасписанияНагрузка.УченоеЗвание,
	|	ПроектШтатногоРасписанияНагрузка.КоличествоСтавок,
	|	ПроектШтатногоРасписанияНагрузка.КоличествоЧасов,
	|	ПроектШтатногоРасписанияНагрузка.ТолькоЧасыДОТ
	|ПОМЕСТИТЬ ШтатноеРасписание
	|ИЗ
	|	Документ.ПроектШтатногоРасписания.Нагрузка КАК ПроектШтатногоРасписанияНагрузка
	|ГДЕ
	|	ПроектШтатногоРасписанияНагрузка.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ШтатноеРасписание.Дата КАК Период,
	|	ШтатноеРасписание.УчебныйГод,
	|	ШтатноеРасписание.Подразделение,
	|	ШтатноеРасписание.Преподаватель,
	|	ШтатноеРасписание.Должность,
	|	ШтатноеРасписание.ВидЗанятости,
	|	ШтатноеРасписание.УченаяСтепень,
	|	ШтатноеРасписание.УченоеЗвание,
	|	ШтатноеРасписание.ТолькоЧасыДОТ,
	|	СУММА(ШтатноеРасписание.КоличествоСтавок) КАК КоличествоСтавок,
	|	СУММА(ШтатноеРасписание.КоличествоЧасов) КАК КоличествоЧасов
	|ИЗ
	|	ШтатноеРасписание КАК ШтатноеРасписание
	|СГРУППИРОВАТЬ ПО
	|	ШтатноеРасписание.УчебныйГод,
	|	ШтатноеРасписание.Подразделение,
	|	ШтатноеРасписание.Преподаватель,
	|	ШтатноеРасписание.Должность,
	|	ШтатноеРасписание.ВидЗанятости,
	|	ШтатноеРасписание.УченаяСтепень,
	|	ШтатноеРасписание.УченоеЗвание,
	|	ШтатноеРасписание.Дата,
	|	ШтатноеРасписание.ТолькоЧасыДОТ
	|ИМЕЮЩИЕ
	|	СУММА(ШтатноеРасписание.КоличествоСтавок) > 0
	|	ИЛИ СУММА(ШтатноеРасписание.КоличествоЧасов) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ШтатноеРасписание.Дата КАК Период,
	|	ШтатноеРасписание.УчебныйГод,
	|	ШтатноеРасписание.Подразделение,
	|	&Ссылка КАК ШтатноеРасписание
	|ИЗ
	|	ШтатноеРасписание КАК ШтатноеРасписание";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатПакета = Запрос.ВыполнитьПакет();
	ТаблицаШтатноеРасписание = РезультатПакета[1].Выгрузить();
	ТаблицаШтатныеРасписанияПодразделений  = РезультатПакета[2].Выгрузить(); 
	
	ТаблицыДляДвижений.Вставить("ШтатноеРасписание", ТаблицаШтатноеРасписание);
	ТаблицыДляДвижений.Вставить("ШтатныеРасписанияПодразделений", ТаблицаШтатныеРасписанияПодразделений);
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
